chore(docs): do not track vite cache, update diagrams
